Revit 2027 API
StructuralAsset.StructuralAssetClass Property
 The type of material that this structural asset describes (e.g. wood, concrete, metal.)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralAssetClass StructuralAssetClass { get; }
Public ReadOnly Property StructuralAssetClass As StructuralAssetClass
	Get
public:
property StructuralAssetClass StructuralAssetClass {
	StructuralAssetClass get ();
}
member StructuralAssetClass : StructuralAssetClass with get
Property Value
StructuralAssetClass
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace